Version2/TestTool/TestTool.Setup/Requests/RecordingSearch/GetMediaAttributes/GetMediaAttributes (General).xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:tse="http://www.onvif.org/ver10/search/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <tse:GetMediaAttributes>
      <tse:RecordingTokens>tokenRecording1</tse:RecordingTokens>
      <tse:RecordingTokens>tokenRecording2</tse:RecordingTokens>
      <tse:Time>2013-05-28T07:56:23Z</tse:Time>
    </tse:GetMediaAttributes>
  </soap:Body>
</soap:Envelope>